{"id":87450,"xmlId":"com.google.gct.core","name":"Cloud Code","description":"\n\n    \n\n\n<p>Cloud Code helps you write, deploy, and debug cloud native, Kubernetes, Cloud Run, and App Engine applications\n    quickly and easily, and adds support for many Google Cloud Platform features. Create, update, and maintain Kubernetes resource files within\n    IntelliJ. Build an accelerated feedback loop between your local machine and development cluster.\n    Run Kubernetes wherever works best for you — whether in a local cluster or in the cloud. Deploy your Cloud Run applications to Cloud Run\n    fully managed or Anthos on GKE.\n</p>\n<br>\n<p>\n    Use templates available with Cloud Code for IntelliJ to quickly define Kubernetes resource files.\n    Deploy Java back ends for your cloud apps to App Engine. Use hosted Git repos on Google Cloud\n    Platform with Cloud Code for IntelliJ to store source code with your deployed services.\n    You can also use Cloud Debugger for real-time debugging of your cloud back end.\n</p>\n<br>\n<h2>Key Features</h2>\n<ul>\n    <li>Kubernetes deployment in all JetBrains IDEs</li>\n    <li>Kubernetes config-free debugging for Java, Kotlin, Node.js, and Go</li>\n    <li>Kubernetes log streaming integrated with deployment and debugging</li>\n    <li>Cloud Run deployment to either Cloud Run fully managed or Cloud Run for Anthos (GKE)</li>\n    <li>Editing support for for various configuration files including Cloud Build, Kustomize, and Kubernetes</li>\n    <li>Kubernetes cluster browser</li>\n    <li>Cloud Run service browser</li>\n    <li>Google Cloud API management</li>\n    <li>Google Cloud Storage browser</li>\n    <li>Google Cloud Source Repository integration</li>\n    <li>Google Cloud Debugger integration</li>\n    <li>Automatically installs key Kubernetes CLI dependencies and the Google Cloud SDK</li>\n    <li>Automatically uses Cloud SDK credentials for most features</li>\n    <li>Uses IDE-managed Google Cloud credentials for App Engine, Cloud Source Repositories, Cloud Storage, Cloud Debugger, and Client Library Manager</li>\n</ul>\n<br>\n<p>Refer to <a href=\"https://cloud.google.com/code/docs/intellij/\">Google Cloud Code\n    documentation</a>\n    for more information.</p>\n<p>\n    To help improve the Cloud Code plugin, feature usage statistics are collected and sent to\n    Google. You can opt-out at any time by visiting Settings &gt; Cloud Code &gt; Usage Tracking. Your\n    use of this plugin is subject to the\n    <a href=\"https://policies.google.com/privacy\">Google Privacy Policy</a>.\n</p>\n<br>\n\n\n","tags":["Cloud Support"],"vendor":"Google Cloud","version":"20.5.1","notes":"\n\n\n    \n\n\n\n\n<h2>Version 20.5.1 - Current Release</h2>\n\n<p>Note: In the next release we plan to bump the minimum supported platform version to 2019.3. If you are on 2019.2, we recommend that you upgrade so that you will continue to get Cloud Code updates.</p>\n\n<h3>New Features</h3>\n\n<ul>\n    <li>You can now grab an interactive terminal into pods and containers from the Kubernetes Explorer. This feature is available for IDE versions 2019.3 and later.</li>\n    <li></li>\n    <li>The Kubernetes Explorer now maintains its state through refreshes so that you don’t lose your location in the tree.</li>\n    <li>The Kubernetes Explorer now automatically updates its state on changes so that you are immediately aware of changes to your cluster without having to manually refresh.</li>\n</ul>\n\n<h3>Updates</h3>\n\n<ul>\n    <li>Hovering over a Pod in Kubernetes Explorer will display more information from the Conditions Array of the Pod Status.</li>\n</ul>\n\n<h3>Fixes</h3>\n\n<ul>\n    <li>Fixed an `IllegalStateException: Duplicate Key` error with App Engine causing some Gradle projects to not properly import.</li>\n</ul>\n\n\n\n","dependencies":["(optional) com.intellij.modules.java","(optional) org.jetbrains.idea.maven","(optional) org.jetbrains.plugins.go","(optional) com.intellij.gwt","org.jetbrains.plugins.yaml","com.intellij.modules.vcs","Git4Idea","(optional) org.jetbrains.kotlin","(optional) com.intellij.javaee","com.intellij.modules.lang","(optional) com.intellij.gradle","org.jetbrains.plugins.terminal","(optional) JavaScriptDebugger"],"since":"192.0","until":"202.*","size":34753302}